In [12]:
import numpy as np 
import pandas as pd 
from pandas import Series,DataFrame
df = DataFrame({'key1':['a','a','b','b','a'],
               'key2':['one','two','one','two','one'],
               'data1':np.random.randn(5),'data2':np.random.randn(5)})
df

      data1     data2 key1 key2
0  1.625537 -0.322796    a  one
1 -0.972443  0.170715    a  two
2 -0.472042 -1.458133    b  one
3  0.767088  0.498318    b  two
4 -0.642728 -0.926267    a  one

In [13]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [14]:
grouped.mean()

key1
a    0.003455
b    0.147523
Name: data1, dtype: float64

In [15]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one     0.491405
      two    -0.972443
b     one    -0.472042
      two     0.767088
Name: data1, dtype: float64

In [16]:
means.unstack()

key2       one       two
key1
a     0.491405 -0.972443
b    -0.472042  0.767088

In [17]:
states = np.array(['ohio','california','california','ohio','ohio'])
years = np.array([2005,2005,2006,2005,2006])
df['data1'].groupby([states,years]).mean()

california  2005   -0.972443
            2006   -0.472042
ohio        2005    1.196312
            2006   -0.642728
Name: data1, dtype: float64

In [18]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.003455 -0.359449
b     0.147523 -0.479908

In [19]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.491405 -0.624531
     two  -0.972443  0.170715
b    one  -0.472042 -1.458133
     two   0.767088  0.498318

In [20]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  1.625537 -0.322796    a  one
1 -0.972443  0.170715    a  two
4 -0.642728 -0.926267    a  one
b
      data1     data2 key1 key2
2 -0.472042 -1.458133    b  one
3  0.767088  0.498318    b  two

In [21]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print(k1,k2)
    print(group)

a one
      data1     data2 key1 key2
0  1.625537 -0.322796    a  one
4 -0.642728 -0.926267    a  one
a two
      data1     data2 key1 key2
1 -0.972443  0.170715    a  two
b one
      data1     data2 key1 key2
2 -0.472042 -1.458133    b  one
b two
      data1     data2 key1 key2
3  0.767088  0.498318    b  two

In [22]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

      data1     data2 key1 key2
2 -0.472042 -1.458133    b  one
3  0.767088  0.498318    b  two

In [23]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [24]:
grouped = df.groupby(df.dtypes,axis=1)

In [25]:
dict(list(grouped))

{dtype('float64'):       data1     data2
 0  1.625537 -0.322796
 1 -0.972443  0.170715
 2 -0.472042 -1.458133
 3  0.767088  0.498318
 4 -0.642728 -0.926267, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [26]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [27]:
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])

In [28]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.624531
     two   0.170715
b    one  -1.458133
     two   0.498318

In [29]:
s_grouped = df.groupby(['key1','key2'])['data2']

In [30]:
s_grouped

In [31]:
s_grouped.mean()

key1  key2
a     one    -0.624531
      two     0.170715
b     one    -1.458133
      two     0.498318
Name: data2, dtype: float64

In [32]:
people = DataFrame(np.random.randn(5,5),
                  columns=['a','b','c','d','e'],
                  index=['joe','steve','wes','jim','travis'])

In [33]:
people.ix[2:3,['b','c']]=np.nan

D:\anaconde\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [34]:
people

               a         b         c         d         e
joe    -0.289872 -0.861781 -1.491162  0.903042 -0.902930
steve   1.309299 -0.368444 -1.723997 -0.428687 -0.881880
wes    -1.223173       NaN       NaN -0.364379 -2.234249
jim     0.331402  0.013790  1.649642  0.657677  0.053133
travis  1.583280  1.846433 -0.350961 -0.480262 -1.123339

In [35]:
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [36]:
by_column = people.groupby(mapping,axis=1)
by_column

In [37]:
by_column.sum()

            blue       red
joe    -0.588120 -2.054583
steve  -2.152684  0.058975
wes    -0.364379 -3.457422
jim     2.307319  0.398325
travis -0.831223  2.306374

In [38]:
map_series = Series(mapping)

In [39]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [40]:
people.groupby(map_series,axis=1).count()

        blue  red
joe        2    3
steve      2    3
wes        1    2
jim        2    3
travis     2    3

In [41]:
people.groupby(len).sum()

          a         b         c         d         e
3 -1.181644 -0.847991  0.158480  1.196340 -3.084046
5  1.309299 -0.368444 -1.723997 -0.428687 -0.881880
6  1.583280  1.846433 -0.350961 -0.480262 -1.123339

In [42]:
key_list = ['one','one','one','two','two']

In [43]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -1.223173 -0.861781 -1.491162 -0.364379 -2.234249
  two  0.331402  0.013790  1.649642  0.657677  0.053133
5 one  1.309299 -0.368444 -1.723997 -0.428687 -0.881880
6 two  1.583280  1.846433 -0.350961 -0.480262 -1.123339

In [44]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],
                                    names=['cty','tenor'])

In [45]:
hier_df = DataFrame(np.random.randn(4,5),columns=columns)

In [46]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.209310 -0.726337  1.239265 -0.991827  0.338166
1     -0.792206 -1.508804  0.303661  1.370282  0.563167
2      0.596688  1.042261 -2.565764 -1.471940  0.401065
3     -0.962307 -0.916718  0.254739 -0.478444 -1.022750

In [47]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [48]:
df

      data1     data2 key1 key2
0  1.625537 -0.322796    a  one
1 -0.972443  0.170715    a  two
2 -0.472042 -1.458133    b  one
3  0.767088  0.498318    b  two
4 -0.642728 -0.926267    a  one

In [49]:
grouped = df.groupby('key1')

In [50]:
grouped['data1'].quantile(0.9)

key1
a    1.171884
b    0.643175
Name: data1, dtype: float64

In [51]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [52]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.597981  1.096981
b     1.239130  1.956451

In [50]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.112701  0.859971 -1.007924 -0.522573 -0.037222  0.334910
b      2.0  0.534215  0.067460  0.486513  0.510364  0.534215  0.558066

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.707043   3.0  0.187506  0.928401 -0.795274 -0.243619  0.308037
b     0.581917   2.0 -0.376149  1.355909 -1.334922 -0.855535 -0.376149


           75%       max
key1
a     0.678896  1.049755
b     0.103237  0.582624

In [53]:
import numpy as np 
import pandas as pd 
from pandas import Series,DataFrame
tips = pd.read_csv(r'D:\pythondata\ch08\tips.csv')

In [54]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [55]:
tips[:6]

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808
5       25.29  4.71    Male     No  Sun  Dinner     4  0.186240

In [56]:
grouped = tips.groupby(['sex','smoker'])

In [57]:
grouped_pct = grouped['tip_pct']

In [58]:
grouped_pct.agg('mean')

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

In [59]:
grouped_pct.agg(['mean','std',peak_to_peak])

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

In [60]:
grouped_pct.agg([('foo','mean'),('bar',np.std)])

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

In [61]:
functions = ['count','mean','max']

In [62]:
result = grouped['tip_pct','total_bill'].agg(functions)

In [63]:
result

              tip_pct                     total_bill
                count      mean       max      count       mean    max
sex    smoker
Female No          54  0.156921  0.252672         54  18.105185  35.83
       Yes         33  0.182150  0.416667         33  17.977879  44.30
Male   No          97  0.160669  0.291990         97  19.791237  48.33
       Yes         60  0.152771  0.710345         60  22.284500  50.81

In [64]:
result['tip_pct']

               count      mean       max
sex    smoker
Female No         54  0.156921  0.252672
       Yes        33  0.182150  0.416667
Male   No         97  0.160669  0.291990
       Yes        60  0.152771  0.710345

In [65]:
ftuples = [('Durchschnitt','mean'),('Abweichung',np.var)]

In [66]:
grouped['tip_pct','total_bill'].agg(ftuples)

                   tip_pct              total_bill
              Durchschnitt Abweichung Durchschnitt Abweichung
sex    smoker
Female No         0.156921   0.001327    18.105185  53.092422
       Yes        0.182150   0.005126    17.977879  84.451517
Male   No         0.160669   0.001751    19.791237  76.152961
       Yes        0.152771   0.008206    22.284500  98.244673

In [67]:
grouped.agg({'tip':np.max,'size':'sum'})

                tip  size
sex    smoker
Female No       5.2   140
       Yes      6.5    74
Male   No       9.0   263
       Yes     10.0   150

In [68]:
grouped.agg({'tip_pct':['min','max','mean','std'],'size':'sum'})

                tip_pct                               size
                    min       max      mean       std  sum
sex    smoker
Female No      0.056797  0.252672  0.156921  0.036421  140
       Yes     0.056433  0.416667  0.182150  0.071595   74
Male   No      0.071804  0.291990  0.160669  0.041849  263
       Yes     0.035638  0.710345  0.152771  0.090588  150

In [69]:
tips.groupby(['sex','smoker'],as_index=False).mean()

      sex smoker  total_bill       tip      size   tip_pct
0  Female     No   18.105185  2.773519  2.592593  0.156921
1  Female    Yes   17.977879  2.931515  2.242424  0.182150
2    Male     No   19.791237  3.113402  2.711340  0.160669
3    Male    Yes   22.284500  3.051167  2.500000  0.152771

In [70]:
df

      data1     data2 key1 key2
0  1.625537 -0.322796    a  one
1 -0.972443  0.170715    a  two
2 -0.472042 -1.458133    b  one
3  0.767088  0.498318    b  two
4 -0.642728 -0.926267    a  one

In [71]:
k1_means = df.groupby('key1').mean().add_prefix('mean_')

In [72]:
k1_means

      mean_data1  mean_data2
key1
a       0.003455   -0.359449
b       0.147523   -0.479908

In [73]:
pd.merge(df,k1_means,left_on='key1',right_index=True)

      data1     data2 key1 key2  mean_data1  mean_data2
0  1.625537 -0.322796    a  one    0.003455   -0.359449
1 -0.972443  0.170715    a  two    0.003455   -0.359449
4 -0.642728 -0.926267    a  one    0.003455   -0.359449
2 -0.472042 -1.458133    b  one    0.147523   -0.479908
3  0.767088  0.498318    b  two    0.147523   -0.479908

In [74]:
key = ['one','two','one','two','one']

In [75]:
people.groupby(key).mean()

            a         b         c         d         e
one  0.023412  0.492326 -0.921061  0.019467 -1.420173
two  0.820350 -0.177327 -0.037177  0.114495 -0.414373

In [76]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e
joe     0.023412  0.492326 -0.921061  0.019467 -1.420173
steve   0.820350 -0.177327 -0.037177  0.114495 -0.414373
wes     0.023412  0.492326 -0.921061  0.019467 -1.420173
jim     0.820350 -0.177327 -0.037177  0.114495 -0.414373
travis  0.023412  0.492326 -0.921061  0.019467 -1.420173

In [77]:
def demean(arr):
    return arr - arr.mean()

In [78]:
demeaned = people.groupby(key).transform(demean)

In [79]:
demeaned

               a         b         c         d         e
joe    -0.313284 -1.354107 -0.570101  0.883575  0.517243
steve   0.488949 -0.191117 -1.686820 -0.543182 -0.467506
wes    -1.246585       NaN       NaN -0.383846 -0.814077
jim    -0.488949  0.191117  1.686820  0.543182  0.467506
travis  1.559868  1.354107  0.570101 -0.499729  0.296834

In [80]:
demeaned.groupby(key).mean()

                a             b             c             d             e
one  0.000000e+00  0.000000e+00  5.551115e-17 -1.850372e-17 -1.110223e-16
two  5.551115e-17 -1.387779e-17  0.000000e+00  0.000000e+00  2.775558e-17

In [81]:
def top(df,n=5,column='tip_pct'):
    return df.sort_index(by=column)[-n:]

In [82]:
top(tips,n=6)

D:\anaconde\anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)

     total_bill   tip     sex smoker  day    time  size   tip_pct
109       14.31  4.00  Female    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39    Male     No  Sat  Dinner     2  0.291990
67         3.07  1.00  Female    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes  Sun  Dinner     2  0.710345

In [83]:
tips.groupby('smoker').apply(top)

D:\anaconde\anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [84]:
tips.groupby(['smoker','day']).apply(top,n=1,column='total_bill')

D:\anaconde\anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)

                 total_bill    tip     sex smoker   day    time  size  \
smoker day
No     Fri  94        22.75   3.25  Female     No   Fri  Dinner     2
       Sat  212       48.33   9.00    Male     No   Sat  Dinner     4
       Sun  156       48.17   5.00    Male     No   Sun  Dinner     6
       Thur 142       41.19   5.00    Male     No  Thur   Lunch     5
Yes    Fri  95        40.17   4.73    Male    Yes   Fri  Dinner     4
       Sat  170       50.81  10.00    Male    Yes   Sat  Dinner     3
       Sun  182       45.35   3.50    Male    Yes   Sun  Dinner     3
       Thur 197       43.11   5.00  Female    Yes  Thur   Lunch     4

                  tip_pct
smoker day
No     Fri  94   0.142857
       Sat  212  0.186220
       Sun  156  0.103799
       Thur 142  0.121389
Yes    Fri  95   0.117750
       Sat  170  0.196812
       Sun  182  0.077178
       Thur 197  0.115982

In [85]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [86]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [87]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [88]:
f = lambda x:x.describe()

In [89]:
grouped.apply(f)

                     total_bill        tip       size    tip_pct
sex    smoker
Female No     count   54.000000  54.000000  54.000000  54.000000
              mean    18.105185   2.773519   2.592593   0.156921
              std      7.286455   1.128425   1.073146   0.036421
              min      7.250000   1.000000   1.000000   0.056797
              25%     12.650000   2.000000   2.000000   0.139708
              50%     16.690000   2.680000   2.000000   0.149691
              75%     20.862500   3.437500   3.000000   0.181630
              max     35.830000   5.200000   6.000000   0.252672
       Yes    count   33.000000  33.000000  33.000000  33.000000
              mean    17.977879   2.931515   2.242424   0.182150
              std      9.189751   1.219916   0.613917   0.071595
              min      3.070000   1.000000   1.000000   0.056433
              25%     12.760000   2.000000   2.000000   0.152439
              50%     16.270000   2.880000   2.000000   0.173913
              75%     22.120000   3.500000   2.000000   0.198216
              max     44.300000   6.500000   4.000000   0.416667
Male   No     count   97.000000  97.000000  97.000000  97.000000
              mean    19.791237   3.113402   2.711340   0.160669
              std      8.726566   1.489559   0.989094   0.041849
              min      7.510000   1.250000   2.000000   0.071804
              25%     13.810000   2.000000   2.000000   0.131810
              50%     18.240000   2.740000   2.000000   0.157604
              75%     22.820000   3.710000   3.000000   0.186220
              max     48.330000   9.000000   6.000000   0.291990
       Yes    count   60.000000  60.000000  60.000000  60.000000
              mean    22.284500   3.051167   2.500000   0.152771
              std      9.911845   1.500120   0.892530   0.090588
              min      7.250000   1.000000   1.000000   0.035638
              25%     15.272500   2.000000   2.000000   0.101845
              50%     20.390000   3.000000   2.000000   0.141015
              75%     28.572500   3.820000   3.000000   0.191697
              max     50.810000  10.000000   5.000000   0.710345

In [90]:
tips.groupby('smoker',group_keys=False).apply(top)

D:\anaconde\anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)

     total_bill   tip     sex smoker   day    time  size   tip_pct
88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [91]:
frame = DataFrame({'data1':np.random.randn(1000),'data2':np.random.randn(1000)})

In [92]:
factor = pd.cut(frame.data1,4)

In [93]:
factor[:10]

0     (-0.167, 1.509]
1     (-0.167, 1.509]
2    (-1.843, -0.167]
3    (-1.843, -0.167]
4    (-1.843, -0.167]
5    (-1.843, -0.167]
6     (-0.167, 1.509]
7    (-1.843, -0.167]
8     (-0.167, 1.509]
9     (-0.167, 1.509]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.526, -1.843] < (-1.843, -0.167] < (-0.167, 1.509] < (1.509, 3.185]]

In [94]:
def get_stats(group):
    return {'min':group.min(),'max':group.max(),'count':group.count(),'mean':group.mean()}

In [95]:
grouped = frame.data2.groupby(factor)

In [96]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.526, -1.843]   36.0  2.844332 -0.217292 -2.066938
(-1.843, -0.167]  362.0  3.069943 -0.041988 -2.598154
(-0.167, 1.509]   533.0  2.682390 -0.041613 -3.098818
(1.509, 3.185]     69.0  1.925457 -0.052588 -2.479931

In [95]:
grouping = pd.qcut(frame.data1,10,labels=False)

In [97]:
grouped = frame.data2.groupby(grouping)

NameError: name 'grouping' is not defined

In [98]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.526, -1.843]   36.0  2.844332 -0.217292 -2.066938
(-1.843, -0.167]  362.0  3.069943 -0.041988 -2.598154
(-0.167, 1.509]   533.0  2.682390 -0.041613 -3.098818
(1.509, 3.185]     69.0  1.925457 -0.052588 -2.479931

In [99]:
s = Series(np.random.randn(6))

In [100]:
s[::2]=np.nan

In [101]:
s

0         NaN
1   -0.822931
2         NaN
3   -2.062097
4         NaN
5    0.043044
dtype: float64

In [102]:
s.fillna(s.mean())

0   -0.947328
1   -0.822931
2   -0.947328
3   -2.062097
4   -0.947328
5    0.043044
dtype: float64

In [103]:
states = ['ohio','new york','vermont','florida','oregon','nevada','california','idaho']

In [104]:
group_key = ['east']*4 + ['west']* 4

In [105]:
import pandas as pd 
import numpy as np 
from pandas  import Series,DataFrame
data = Series(np.random.randn(8),index=states)

In [106]:
data[['vermont','nevada','ohio']]=np.nan

In [107]:
data

ohio               NaN
new york      0.113815
vermont            NaN
florida      -0.254933
oregon       -1.873020
nevada             NaN
california   -2.051177
idaho        -2.223520
dtype: float64

In [108]:
data.groupby(group_key).mean()

east   -0.070559
west   -2.049239
dtype: float64

In [109]:
fill_mean = lambda g:g.fillna(g.mean())

In [110]:
data.groupby(group_key).apply(fill_mean)

ohio         -0.070559
new york      0.113815
vermont      -0.070559
florida      -0.254933
oregon       -1.873020
nevada       -2.049239
california   -2.051177
idaho        -2.223520
dtype: float64

In [111]:
fill_values = {'east':0.5,'west':-1}

In [112]:
fill_func = lambda g:g.fillna(fill_values[g.name])

In [113]:
data.groupby(group_key).apply(fill_func)

ohio          0.500000
new york      0.113815
vermont       0.500000
florida      -0.254933
oregon       -1.873020
nevada       -1.000000
california   -2.051177
idaho        -2.223520
dtype: float64

In [136]:
import numpy as np 
import pandas as pd
from pandas import Series,DataFrame
import matplotlib.pyplot as plt

suits = ['H','S','C','D']
card_val = (list(range(1,11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2,11)) + ['J','K','Q']
cards = []
for suit in ['H','S','C','D']:
    cards.extend(str(num) + suit for num in base_names)

deck = Series(card_val,index=cards)

In [137]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [138]:
def draw(deck,n=5):
    return deck.take(np.random.permutation(len(deck))[:n])

In [139]:
draw(deck)

10S    10
4S      4
3C      3
KC     10
2S      2
dtype: int64

In [140]:
get_suit = lambda card:card[-1]

In [141]:
deck.groupby(get_suit).apply(draw,n=2)

C  3C     3
   5C     5
D  5D     5
   KD    10
H  5H     5
   AH     1
S  7S     7
   3S     3
dtype: int64

In [142]:
deck.groupby(get_suit,group_keys=False).apply(draw,n=2)

QC    10
8C     8
KD    10
5D     5
6H     6
5H     5
2S     2
5S     5
dtype: int64

In [143]:
df = DataFrame({'category':['a','a','a','a','b','b','b','b'],'data':np.random.randn(8),
               'weights':np.random.rand(8)})

In [144]:
df

  category      data   weights
0        a  0.913832  0.407806
1        a -0.318085  0.752701
2        a -1.006115  0.943022
3        a  0.487240  0.814048
4        b  1.926308  0.688298
5        b  0.781211  0.575816
6        b  1.033795  0.384786
7        b  0.567092  0.899944

In [145]:
grouped = df.groupby('category')

In [146]:
get_wavg = lambda g:np.average(g['data'],weights=g['weights'])

In [147]:
grouped.apply(get_wavg)

category
a   -0.143581
b    1.052967
dtype: float64

In [154]:
close_px = pd.read_csv('D:\pythondata\ch09\stock_px.csv',parse_dates=True,index_col=0)

In [155]:
close_px

              AAPL   MSFT    XOM      SPX
2003-01-02    7.40  21.11  29.22   909.03
2003-01-03    7.45  21.14  29.24   908.59
2003-01-06    7.45  21.52  29.96   929.01
2003-01-07    7.43  21.93  28.95   922.93
2003-01-08    7.28  21.31  28.83   909.93
2003-01-09    7.34  21.93  29.44   927.57
2003-01-10    7.36  21.97  29.03   927.57
2003-01-13    7.32  22.16  28.91   926.26
2003-01-14    7.30  22.39  29.17   931.66
2003-01-15    7.22  22.11  28.77   918.22
2003-01-16    7.31  21.75  28.90   914.60
2003-01-17    7.05  20.22  28.60   901.78
2003-01-21    7.01  20.17  27.94   887.62
2003-01-22    6.94  20.04  27.58   878.36
2003-01-23    7.09  20.54  27.52   887.34
2003-01-24    6.90  19.59  26.93   861.40
2003-01-27    7.07  19.32  26.21   847.48
2003-01-28    7.29  19.18  26.90   858.54
2003-01-29    7.47  19.61  27.88   864.36
2003-01-30    7.16  18.95  27.37   844.61
2003-01-31    7.18  18.65  28.13   855.70
2003-02-03    7.33  19.08  28.52   860.32
2003-02-04    7.30  18.59  28.52   848.20
2003-02-05    7.22  18.45  28.11   843.59
2003-02-06    7.22  18.63  27.87   838.15
2003-02-07    7.07  18.30  27.66   829.69
2003-02-10    7.18  18.62  27.87   835.97
2003-02-11    7.18  18.25  27.67   829.20
2003-02-12    7.20  18.25  27.12   818.68
2003-02-13    7.27  18.46  27.47   817.37
...            ...    ...    ...      ...
2011-09-02  374.05  25.80  72.14  1173.97
2011-09-06  379.74  25.51  71.15  1165.24
2011-09-07  383.93  26.00  73.65  1198.62
2011-09-08  384.14  26.22  72.82  1185.90
2011-09-09  377.48  25.74  71.01  1154.23
2011-09-12  379.94  25.89  71.84  1162.27
2011-09-13  384.62  26.04  71.65  1172.87
2011-09-14  389.30  26.50  72.64  1188.68
2011-09-15  392.96  26.99  74.01  1209.11
2011-09-16  400.50  27.12  74.55  1216.01
2011-09-19  411.63  27.21  73.70  1204.09
2011-09-20  413.45  26.98  74.01  1202.09
2011-09-21  412.14  25.99  71.97  1166.76
2011-09-22  401.82  25.06  69.24  1129.56
2011-09-23  404.30  25.06  69.31  1136.43
2011-09-26  403.17  25.44  71.72  1162.95
2011-09-27  399.26  25.67  72.91  1175.38
2011-09-28  397.01  25.58  72.07  1151.06
2011-09-29  390.57  25.45  73.88  1160.40
2011-09-30  381.32  24.89  72.63  1131.42
2011-10-03  374.60  24.53  71.15  1099.23
2011-10-04  372.50  25.34  72.83  1123.95
2011-10-05  378.25  25.89  73.95  1144.03
2011-10-06  377.37  26.34  73.89  1164.97
2011-10-07  369.80  26.25  73.56  1155.46
2011-10-10  388.81  26.94  76.28  1194.89
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

[2214 rows x 4 columns]

In [156]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [158]:
rets = close_px.pct_change().dropna()

In [159]:
spx_corr = lambda x :x.corrwith(x['SPX'])

In [160]:
by_year = rets.groupby(lambda x:x.year)

In [161]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [162]:
by_year.apply(lambda g:g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64